month = input("Введите порядковый номер месяца: ")
month_int = int(month)
year = dict([("1", "Январь"), ("2", "Февраль"), ("3", "Март"),
             ("4", "Апрель"), ("5", "Май"), ("6", "Июнь"),
             ("7", "Июль"), ("8", "Август"), ("9", "Сентябрь"),
             ("10", "Октябрь"), ("11", "Ноябрь"), ("12", "Декабрь")])

if month_int < 3 or month_int == 12:
    season = "Зима"
elif month_int < 6:
    season = "Весна"
elif month_int < 9:
    season = "Лето"
else:
    season = "Осень"

print(f"Ваш месяц - {year[month]}. Время года - {season}")

